Revit 2024 API
Wire Class
 Electrical wire element.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class Wire : MEPCurve
Visual Basic
Public Class Wire _
	Inherits MEPCurve
Visual C++
public ref class Wire : public MEPCurve
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.MEPCurve
 Autodesk.Revit.DB.Electrical.Wire
See Also
Wire Members
Autodesk.Revit.DB.Electrical Namespace